In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['a', 'b', np.nan, 'c'])

In [3]:
string_data

0      a
1      b
2    NaN
3      c
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0]=None

In [6]:
string_data

0    None
1       b
2     NaN
3       c
dtype: object

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [14]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

In [8]:
string_data.dropna()

1    b
3    c
dtype: object

In [9]:
string_data.fillna(2)

0    2
1    b
2    2
3    c
dtype: object

In [51]:
from numpy import nan as NA

In [11]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [12]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data[data.isnull()]

1   NaN
3   NaN
dtype: float64

In [17]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [18]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
....: [NA, NA, NA], [NA, 6.5, 3.]])

In [19]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
cleaned = data.dropna()

In [21]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [23]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [24]:
data[3]=NA

In [25]:
data

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
data.dropna(how = 'all' , axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
data.dropna(how = 'all' , axis=0)

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [28]:
df=pd.DataFrame((np.random.randn(7,3)))

In [29]:
df

          0         1         2
0  0.441208  0.158112  0.131324
1  0.268148  0.807303  0.991109
2  0.182449  0.289241 -1.564183
3 -0.507228  0.571815  0.619437
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [30]:
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA

In [31]:
df

          0         1         2
0  0.441208       NaN       NaN
1  0.268148       NaN       NaN
2  0.182449       NaN -1.564183
3 -0.507228       NaN  0.619437
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [32]:
df.dropna()

          0         1         2
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [33]:
df.dropna(thresh=2)

          0         1         2
2  0.182449       NaN -1.564183
3 -0.507228       NaN  0.619437
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [34]:
df.dropna(thresh=1)

          0         1         2
0  0.441208       NaN       NaN
1  0.268148       NaN       NaN
2  0.182449       NaN -1.564183
3 -0.507228       NaN  0.619437
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [35]:
df.dropna(thresh=3)

          0         1         2
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [36]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [37]:
df

          0         1         2
0  0.441208       NaN       NaN
1  0.268148       NaN       NaN
2  0.182449       NaN -1.564183
3 -0.507228       NaN  0.619437
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [38]:
df.fillna(0)

          0         1         2
0  0.441208  0.000000  0.000000
1  0.268148  0.000000  0.000000
2  0.182449  0.000000 -1.564183
3 -0.507228  0.000000  0.619437
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [42]:
df

          0         1         2
0  0.441208       NaN       NaN
1  0.268148       NaN       NaN
2  0.182449       NaN -1.564183
3 -0.507228       NaN  0.619437
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [39]:
df.fillna({1:5,2:6})

          0         1         2
0  0.441208  5.000000  6.000000
1  0.268148  5.000000  6.000000
2  0.182449  5.000000 -1.564183
3 -0.507228  5.000000  0.619437
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [40]:
df.fillna({1:5,2:6} ,axis=0)

          0         1         2
0  0.441208  5.000000  6.000000
1  0.268148  5.000000  6.000000
2  0.182449  5.000000 -1.564183
3 -0.507228  5.000000  0.619437
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [41]:
df.fillna({1:5,2:6}, axis=1)

NotImplementedError: Currently only can fill with dict/Series column by column

In [43]:
df

          0         1         2
0  0.441208       NaN       NaN
1  0.268148       NaN       NaN
2  0.182449       NaN -1.564183
3 -0.507228       NaN  0.619437
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [ ]:
df.fillna(4)

In [ ]:
df

In [ ]:
df.fillna(4 ,axis=1)

In [ ]:

df

In [ ]:
df

In [44]:
df.fillna(0 , inplace=True)

In [45]:
df

          0         1         2
0  0.441208  0.000000  0.000000
1  0.268148  0.000000  0.000000
2  0.182449  0.000000 -1.564183
3 -0.507228  0.000000  0.619437
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [46]:
df

          0         1         2
0  0.441208  0.000000  0.000000
1  0.268148  0.000000  0.000000
2  0.182449  0.000000 -1.564183
3 -0.507228  0.000000  0.619437
4  1.991337 -0.559896 -1.587802
5  0.446372 -0.906444 -0.121092
6  0.973101 -0.836017 -0.651551

In [47]:
df2 = pd.DataFrame(np.random.randn(6, 3))

In [48]:
df2

          0         1         2
0 -0.641263 -0.271203  0.079755
1  0.754602 -0.605625  1.423860
2  1.994027 -1.422723 -0.159980
3  0.514335  0.651629 -0.188049
4 -0.081436 -0.153185 -0.032331
5  0.236511  1.945753 -0.944747

In [71]:
df2.iloc[2:, 1] = NA
df2.iloc[4,1]= 5
df2.iloc[4:, 2] = NA

In [72]:
df2

          0         1         2
0 -0.641263 -0.271203  0.079755
1  0.754602 -0.605625  1.423860
2  1.994027       NaN -0.159980
3  0.514335       NaN -0.188049
4 -0.081436  5.000000       NaN
5  0.236511       NaN       NaN

In [52]:
df2.fillna(method='ffill')

          0         1         2
0 -0.641263 -0.271203  0.079755
1  0.754602 -0.605625  1.423860
2  1.994027 -0.605625 -0.159980
3  0.514335 -0.605625 -0.188049
4 -0.081436 -0.605625 -0.188049
5  0.236511 -0.605625 -0.188049

In [60]:
df2.fillna(method='ffill' , limit=4)

          0         1         2
0 -0.641263 -0.271203  0.079755
1  0.754602 -0.605625  1.423860
2  1.994027 -0.605625 -0.159980
3  0.514335 -0.605625 -0.188049
4 -0.081436  5.000000 -0.188049
5  0.236511  5.000000 -0.188049

In [61]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [62]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [66]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [64]:
(1+3.5+7)/5

2.3

In [65]:
(1+3.5+7)/3

3.8333333333333335

In [63]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [73]:
df2

          0         1         2
0 -0.641263 -0.271203  0.079755
1  0.754602 -0.605625  1.423860
2  1.994027       NaN -0.159980
3  0.514335       NaN -0.188049
4 -0.081436  5.000000       NaN
5  0.236511       NaN       NaN

In [74]:
df2.fillna(method='bfill')

          0         1         2
0 -0.641263 -0.271203  0.079755
1  0.754602 -0.605625  1.423860
2  1.994027  5.000000 -0.159980
3  0.514335  5.000000 -0.188049
4 -0.081436  5.000000       NaN
5  0.236511       NaN       NaN

In [75]:
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html

In [90]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
....: 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [91]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [92]:
'a'*4

'aaaa'

In [93]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [94]:
#data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
....: 'k2': [1, 1, 2, 3, 3, 4, 5]})

SyntaxError: invalid syntax (<ipython-input-94-9ce53b603c8a>, line 2)

In [95]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [96]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [97]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [98]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [99]:
data['v1'] = range(7)

In [100]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [102]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [101]:
data.duplicated('k1')

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [103]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [104]:
data.drop_duplicates(['k1', 'k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [105]:
data.drop_duplicates(['k1', 'k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [106]:
data = pd.DataFrame({'food': ['bacon', 'Donkey meat', 'bacon',
....: 'Pastrami', 'corned beef', 'Bacon',
....: 'pastrami', 'honey ham', 'nova lox'],
....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [109]:
data

          food  ounces
0        bacon     4.0
1  Donkey meat     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [110]:
meat_to_animal = {
'bacon': 'pig',
'donkey meat': 'donkey',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [111]:
meat_to_animal

{'bacon': 'pig',
 'donkey meat': 'donkey',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [112]:
foods = data['food'].str.lower()

In [116]:
foods

0          bacon
1    donkey meat
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [117]:
data['animal']= foods.map(meat_to_animal)

In [115]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  Donkey meat     3.0  donkey
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [118]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [119]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [120]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [121]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [ ]:

data.replace([-999,-1000],[np.nan,5])

In [122]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [124]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [123]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [ ]:
data.replace({-999: np.nan, -1000: 0}, inplace=True)

In [125]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
....: index=['Ohio', 'Colorado', 'New York'],
....: columns=['one', 'two', 'three', 'four'])

In [126]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [128]:
transform = lambda x: x[:4].upper()

In [129]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [132]:
data.columns.map(transform)

Index(['ONE', 'TWO', 'THRE', 'FOUR'], dtype='object')

In [133]:
data.index=data.index.map(transform)

In [134]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [135]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [ ]:
data

In [136]:
data.rename(index={'OHIO':'Lahore'} , columns={'one':'five'})

        five  two  three  four
Lahore     0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [137]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [138]:
data.rename(index={'OHIO':'Karachi'} , columns={'one':'five'} , inplace=True)

In [140]:
data

         five  two  three  four
Karachi     0    1      2     3
COLO        4    5      6     7
NEW         8    9     10    11

In [ ]:
#rename saves you from the chore of copying the DataFrame manually and assigning
#to its index and columns attributes.

In [ ]:
data

In [ ]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [ ]:
ages

In [ ]:
#18 to 25, 26 to 35, 36 to 60 , 61 to older

In [ ]:
bins = [18, 25, 35, 60, 100]

In [ ]:
patients = pd.cut(ages, bins)

In [ ]:
patients

In [ ]:
patients.codes

In [ ]:
patients.categories

In [ ]:
pd.value_counts(patients)

In [ ]:
pd.cut(ages,[18, 26, 36, 61, 100], right = False)

In [ ]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [ ]:
pd.cut(ages,bins,labels=group_names)

In [ ]:
data = np.random.rand(20)

In [ ]:
data

In [ ]:
np.sort(data )

In [ ]:
pd.cut(data, 4, precision = 2 )

In [ ]:
a=pd.cut(data, 4, precision = 2 )

In [ ]:
a.value_counts()

In [ ]:
data = np.random.randn(1000)

In [ ]:
#data

In [ ]:
patient=pd.qcut(data,4)

In [ ]:
patient

In [ ]:
pd.value_counts(patient)

In [ ]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]) # Testing system of PIAic percenytiklke basis

In [ ]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [ ]:
#data

In [ ]:
data.describe()

In [ ]:
col = data[2]

In [ ]:
#col

In [ ]:
col[np.abs(col)>3]

In [ ]:
data[(np.abs(data) > 3).any(1)]

In [ ]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [ ]:
data.describe()

In [ ]:
np.sign(data).head()

In [ ]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [ ]:
df

In [ ]:
sampler = np.random.permutation(5)

In [ ]:
sampler

In [ ]:
df.take(sampler)

In [ ]:
df.sample(n=3)

In [ ]:
choices = pd.Series([5, 7, -1, 6, 4])

In [ ]:
choices

In [ ]:
draws = choices.sample(n=10, replace=True)

In [ ]:
draws

In [ ]:
draws = choices.sample(n=4, )

In [ ]:
draws

In [ ]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
.....: 'data1': range(6)})

In [ ]:
df

In [ ]:
pd.get_dummies(df['key'])

In [ ]:
dummies=pd.get_dummies(df['key'] , prefix= 'key')

In [ ]:
dummies

In [ ]:
pd.get_dummies(df['data1'])

In [ ]:
df_with_dummy = df[['data1']].join(dummies)

In [ ]:
df_with_dummy

In [ ]:
val = 'a,b, guido'

In [ ]:
val

In [ ]:
val.split(',')

In [ ]:
pieces = [x.strip() for x in val.split(',')]

In [ ]:
pieces

In [ ]:
first, second, third = pieces

In [ ]:
first

In [ ]:
first + '::' + second + '::' + third

In [ ]:
'::'.join(pieces)

In [ ]:
'&'.join(pieces)

In [ ]:
":" in val

In [ ]:
val.index(',')

In [ ]:
val.index(':')

In [ ]:
val.find(':')

In [ ]:
val.count(',')

In [ ]:
val

In [ ]:
val.replace(',', '::')

In [ ]:
val.replace(',','')

# Regular expression

In [ ]:
#Regular expressions provide a flexible way to search or match (often more complex)
#string patterns in text. A single expression, commonly called a regex, is a string
#formed according to the regular expression language.

In [ ]:
import re

In [ ]:
text = "foo bar\t baz \tqux"

In [ ]:
re.split('\s+', text)

In [ ]:
regex = re.compile('\s+')

In [ ]:
regex.split(text)

In [ ]:
regex.findall(text)

In [ ]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [ ]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [ ]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [ ]:
regex.findall(text)